const post_content = [{
    date: "Sep 18 2018",
    title: "乐视终止重组更名未果",
    imgSrc: "/images/post/1.jpg",
    avatar: "/images/avatar/1.png",
    img_condition: true,
    content: "虽然算不上出人意料，但当19日乐视网以一系列公告“摊牌”后，投资者恐怕还是要倒吸一口凉气：来回拉锯多时的乐视影业收购案泡汤了，更名“新乐视”的设想也搁置了。更“糟心”的是，乐视网还一口气提示了“九大风险”，包括贾跃亭持股质押、关联方应收款回收、公司现金流紧张、2017年业绩亏损等。",
    reading: "112",
    collection: "96",
    headImgSrc: "/images/post/1.jpg",
    author: "林白衣",
    dataTime: "24小时前",
    detail: "虽然算不上出人意料，但当19日乐视网以一系列公告“摊牌”后，投资者恐怕还是要倒吸一口凉气：来回拉锯多时的乐视影业收购案泡汤了，更名“新乐视”的设想也搁置了。更“糟心”的是，乐视网还一口气提示了“九大风险”，包括贾跃亭持股质押、关联方应收款回收、公司现金流紧张、2017年业绩亏损等。",
    id: 0

}, {
    date: "Sep 20 2018",
    title: "分包加载",
    imgSrc: "/images/post/2.jpg",
    avatar: "/images/avatar/2.png",
    img_condition: true,
    content: "某些情况下，开发者需要将小程序划分成不同的子包，在构建时打包成不同的分包，用户在使用时按需进行加载。在构建小程序分包项目时， 构建会输出一个或多个功能的分包， 其中每个分包小程序必定含有一个主包， 所谓的主包， 即放置默认启动页面 / TabBar 页面， 以及一些所有分包都需用到公共资源 / JS 脚本， 而分包则是根据开发者的配置进行划分。在小程序启动时， 默认会下载主包并启动主包内页面， 如果用户需要打开分包内某个页面， 客户端会把对应分包下载下来， 下载完成后再进行展示。",
    reading: "200",
    collection: "36",
    headImgSrc: "/images/post/2.jpg",
    author: "林白衣",
    dataTime: "20小时前",
    detail: "某些情况下，开发者需要将小程序划分成不同的子包，在构建时打包成不同的分包，用户在使用时按需进行加载。在构建小程序分包项目时， 构建会输出一个或多个功能的分包， 其中每个分包小程序必定含有一个主包， 所谓的主包， 即放置默认启动页面 / TabBar 页面， 以及一些所有分包都需用到公共资源 / JS 脚本， 而分包则是根据开发者的配置进行划分。在小程序启动时， 默认会下载主包并启动主包内页面， 如果用户需要打开分包内某个页面， 客户端会把对应分包下载下来， 下载完成后再进行展示。",
    id: 1
}, {
    date: "Sep 30 2018",
    title: "分包sadas 加载",
    imgSrc: "/images/post/3.jpg",
    avatar: "/images/avatar/3.png",
    img_condition: true,
    content: "每个分包小程序必定含有一个主包， 所谓的主包， 即放置默认启动页面 / TabBar 页面， 以及一些所有分包都需用到公共资源 / JS 脚本， 而分包则是根据开发者的配置进行划分。在小程序启动时， 默认会下载主包并启动主包内页面， 如果用户需要打开分包内某个页面， 客户端会把对应分包下载下来， 下载完成后再进行展示。",
    reading: "260",
    collection: "180",
    headImgSrc: "/images/post/3.jpg",
    author: "林白衣",
    dataTime: "18小时前",
    detail: "每个分包小程序必定含有一个主包， 所谓的主包， 即放置默认启动页面 / TabBar 页面， 以及一些所有分包都需用到公共资源 / JS 脚本， 而分包则是根据开发者的配置进行划分。在小程序启动时， 默认会下载主包并启动主包内页面， 如果用户需要打开分包内某个页面， 客户端会把对应分包下载下来， 下载完成后再进行展示。",
    id: 2
}, {
    date: "Sep 20 2018",
    title: "收到分包加载",
    imgSrc: "/images/post/4.jpg",
    avatar: "/images/avatar/4.png",
    img_condition: true,
    content: "某包， 其中每个分包进行划分。在小程序启动时， 默认会下载主包并启动主包内页面， 如果用户需要打开分包内某个页面， 客户端会把对应分包下载下来， 下载完成后再进行展示。",
    reading: "860",
    collection: "330",
    headImgSrc: "/images/post/4.jpg",
    author: "林白衣",
    dataTime: "13小时前",
    detail: "某包， 其中每个分包进行划分。在小程序启动时， 默认会下载主包并启动主包内页面， 如果用户需要打开分包内某个页面， 客户端会把对应分包下载下来， 下载完成后再进行展示。",
    id: 3
}];

module.exports = {
    post_content: post_content
}